for-8676/performance_test/FIO/psync/yocto/core2.log
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1)
Jobs: 1 (f=1): [r(1)][5.9%][r=14.9MiB/s][r=3827 IOPS][eta 00m:48s]
Jobs: 1 (f=1): [r(1)][7.8%][r=15.0MiB/s][r=3834 IOPS][eta 00m:47s]
Jobs: 1 (f=1): [r(1)][9.8%][r=15.0MiB/s][r=3836 IOPS][eta 00m:46s]
Jobs: 1 (f=1): [r(1)][11.8%][r=15.4MiB/s][r=3941 IOPS][eta 00m:45s]
Jobs: 1 (f=1): [r(1)][13.7%][r=15.2MiB/s][r=3888 IOPS][eta 00m:44s]
Jobs: 1 (f=1): [r(1)][15.7%][r=14.7MiB/s][r=3753 IOPS][eta 00m:43s]
Jobs: 1 (f=1): [r(1)][17.6%][r=15.2MiB/s][r=3895 IOPS][eta 00m:42s]
Jobs: 1 (f=1): [r(1)][19.6%][r=14.9MiB/s][r=3812 IOPS][eta 00m:41s]
Jobs: 1 (f=1): [r(1)][21.6%][r=15.2MiB/s][r=3883 IOPS][eta 00m:40s]
Jobs: 1 (f=1): [r(1)][23.5%][r=15.1MiB/s][r=3863 IOPS][eta 00m:39s]
Jobs: 1 (f=1): [r(1)][25.5%][r=15.0MiB/s][r=3832 IOPS][eta 00m:38s]
Jobs: 1 (f=1): [r(1)][27.5%][r=14.8MiB/s][r=3780 IOPS][eta 00m:37s]
Jobs: 1 (f=1): [r(1)][29.4%][r=15.3MiB/s][r=3916 IOPS][eta 00m:36s]
Jobs: 1 (f=1): [r(1)][31.4%][r=14.9MiB/s][r=3816 IOPS][eta 00m:35s]
Jobs: 1 (f=1): [r(1)][33.3%][r=15.2MiB/s][r=3883 IOPS][eta 00m:34s]
Jobs: 1 (f=1): [r(1)][35.3%][r=14.9MiB/s][r=3803 IOPS][eta 00m:33s]
Jobs: 1 (f=1): [r(1)][37.3%][r=15.4MiB/s][r=3938 IOPS][eta 00m:32s]
Jobs: 1 (f=1): [r(1)][39.2%][r=14.9MiB/s][r=3811 IOPS][eta 00m:31s]
Jobs: 1 (f=1): [r(1)][41.2%][r=15.1MiB/s][r=3877 IOPS][eta 00m:30s]
Jobs: 1 (f=1): [r(1)][43.1%][r=15.2MiB/s][r=3903 IOPS][eta 00m:29s]
Jobs: 1 (f=1): [r(1)][45.1%][r=15.2MiB/s][r=3901 IOPS][eta 00m:28s]
Jobs: 1 (f=1): [r(1)][47.1%][r=15.0MiB/s][r=3846 IOPS][eta 00m:27s]
Jobs: 1 (f=1): [r(1)][49.0%][r=15.2MiB/s][r=3880 IOPS][eta 00m:26s]
Jobs: 1 (f=1): [r(1)][51.0%][r=15.5MiB/s][r=3958 IOPS][eta 00m:25s]
Jobs: 1 (f=1): [r(1)][52.9%][r=15.2MiB/s][r=3881 IOPS][eta 00m:24s]
Jobs: 1 (f=1): [r(1)][54.9%][r=15.2MiB/s][r=3901 IOPS][eta 00m:23s]
Jobs: 1 (f=1): [r(1)][56.9%][r=15.1MiB/s][r=3876 IOPS][eta 00m:22s]
Jobs: 1 (f=1): [r(1)][58.8%][r=15.0MiB/s][r=3842 IOPS][eta 00m:21s]
Jobs: 1 (f=1): [r(1)][60.8%][r=15.4MiB/s][r=3947 IOPS][eta 00m:20s]
Jobs: 1 (f=1): [r(1)][62.7%][r=15.3MiB/s][r=3924 IOPS][eta 00m:19s]
Jobs: 1 (f=1): [r(1)][64.7%][r=15.2MiB/s][r=3902 IOPS][eta 00m:18s]
Jobs: 1 (f=1): [r(1)][66.7%][r=15.1MiB/s][r=3871 IOPS][eta 00m:17s]
Jobs: 1 (f=1): [r(1)][68.6%][r=15.1MiB/s][r=3856 IOPS][eta 00m:16s]
Jobs: 1 (f=1): [r(1)][70.6%][r=15.2MiB/s][r=3883 IOPS][eta 00m:15s]
Jobs: 1 (f=1): [r(1)][72.5%][r=15.6MiB/s][r=3994 IOPS][eta 00m:14s]
Jobs: 1 (f=1): [r(1)][74.5%][r=15.3MiB/s][r=3915 IOPS][eta 00m:13s]
Jobs: 1 (f=1): [r(1)][76.5%][r=15.0MiB/s][r=3847 IOPS][eta 00m:12s]
Jobs: 1 (f=1): [r(1)][78.4%][r=15.1MiB/s][r=3855 IOPS][eta 00m:11s]
Jobs: 1 (f=1): [r(1)][80.4%][r=15.3MiB/s][r=3929 IOPS][eta 00m:10s]
Jobs: 1 (f=1): [r(1)][82.4%][r=15.3MiB/s][r=3907 IOPS][eta 00m:09s]
Jobs: 1 (f=1): [r(1)][84.3%][r=14.8MiB/s][r=3799 IOPS][eta 00m:08s]
Jobs: 1 (f=1): [r(1)][86.3%][r=15.0MiB/s][r=3841 IOPS][eta 00m:07s]
Jobs: 1 (f=1): [r(1)][88.2%][r=15.4MiB/s][r=3943 IOPS][eta 00m:06s]
Jobs: 1 (f=1): [r(1)][90.2%][r=15.2MiB/s][r=3896 IOPS][eta 00m:05s]
Jobs: 1 (f=1): [r(1)][92.2%][r=15.2MiB/s][r=3901 IOPS][eta 00m:04s]
Jobs: 1 (f=1): [r(1)][94.1%][r=15.5MiB/s][r=3960 IOPS][eta 00m:03s]
Jobs: 1 (f=1): [r(1)][96.1%][r=15.4MiB/s][r=3947 IOPS][eta 00m:02s]
Jobs: 1 (f=1): [r(1)][98.0%][r=15.0MiB/s][r=3852 IOPS][eta 00m:01s]
Jobs: 1 (f=1): [r(1)][100.0%][r=14.5MiB/s][r=3724 IOPS][eta 00m:00s]

rand_read: (groupid=0, jobs=1): err= 0: pid=10506: Mon Apr 21 18:09:30 2025
  read: IOPS=3871, BW=15.1MiB/s (15.9MB/s)(756MiB/50001msec)
    clat (usec): min=158, max=6846, avg=253.51, stdev=155.53
     lat (usec): min=158, max=6847, avg=253.97, stdev=155.53
    clat percentiles (usec):
     |  1.00th=[  186],  5.00th=[  192], 10.00th=[  196], 20.00th=[  206],
     | 30.00th=[  219], 40.00th=[  223], 50.00th=[  227], 60.00th=[  233],
     | 70.00th=[  262], 80.00th=[  289], 90.00th=[  302], 95.00th=[  338],
     | 99.00th=[  676], 99.50th=[  898], 99.90th=[ 1909], 99.95th=[ 4228],
     | 99.99th=[ 5932]
   bw (  KiB/s): min=14192, max=16040, per=100.00%, avg=15507.75, stdev=322.94, samples=99
   iops        : min= 3548, max= 4010, avg=3876.93, stdev=80.74, samples=99
  lat (usec)   : 250=67.39%, 500=31.03%, 750=0.70%, 1000=0.55%
  lat (msec)   : 2=0.23%, 4=0.04%, 10=0.05%
  cpu          : usr=2.44%, sys=19.58%, ctx=197539, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=193583,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=15.1MiB/s (15.9MB/s), 15.1MiB/s-15.1MiB/s (15.9MB/s-15.9MB/s), io=756MiB (793MB), run=50001-50001msec

Disk stats (read/write):
  sdc: ios=192976/491, merge=0/27, ticks=40036/117, in_queue=40210, util=80.69%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1)
Jobs: 1 (f=1): [w(1)][5.9%][w=23.8MiB/s][w=6103 IOPS][eta 00m:48s]
Jobs: 1 (f=1): [w(1)][7.8%][w=6189KiB/s][w=1547 IOPS][eta 00m:47s]
Jobs: 1 (f=1): [w(1)][9.8%][w=29.4MiB/s][w=7529 IOPS][eta 00m:46s]
Jobs: 1 (f=1): [w(1)][11.8%][w=26.5MiB/s][w=6785 IOPS][eta 00m:45s]
Jobs: 1 (f=1): [w(1)][13.7%][w=22.8MiB/s][w=5826 IOPS][eta 00m:44s]
Jobs: 1 (f=1): [w(1)][15.7%][w=19.7MiB/s][w=5030 IOPS][eta 00m:43s]
Jobs: 1 (f=1): [w(1)][17.6%][w=22.0MiB/s][w=5637 IOPS][eta 00m:42s]
Jobs: 1 (f=1): [w(1)][19.6%][w=23.1MiB/s][w=5910 IOPS][eta 00m:41s]
Jobs: 1 (f=1): [w(1)][21.6%][w=22.2MiB/s][w=5676 IOPS][eta 00m:40s]
Jobs: 1 (f=1): [w(1)][23.5%][w=16.1MiB/s][w=4127 IOPS][eta 00m:39s]
Jobs: 1 (f=1): [w(1)][25.5%][w=5044KiB/s][w=1261 IOPS][eta 00m:38s]
Jobs: 1 (f=1): [w(1)][27.5%][w=16.1MiB/s][w=4112 IOPS][eta 00m:37s]
Jobs: 1 (f=1): [w(1)][29.4%][w=13.2MiB/s][w=3380 IOPS][eta 00m:36s]
Jobs: 1 (f=1): [w(1)][31.4%][w=16.0MiB/s][w=4103 IOPS][eta 00m:35s]
Jobs: 1 (f=1): [w(1)][33.3%][w=17.9MiB/s][w=4573 IOPS][eta 00m:34s]
Jobs: 1 (f=1): [w(1)][35.3%][w=16.9MiB/s][w=4327 IOPS][eta 00m:33s]
Jobs: 1 (f=1): [w(1)][37.3%][w=20.7MiB/s][w=5293 IOPS][eta 00m:32s]
Jobs: 1 (f=1): [w(1)][39.2%][w=27.8MiB/s][w=7104 IOPS][eta 00m:31s]